# Features of Pandas(Panel Data):

## -Series Object and Dataframe
## -Handling of missing data
## -Data alignment
## -Slicing indexing subseting 
## -Merging and joining
## -Reshaping
## -Hierarchical labeling of axes
## -Robust Input Output tool
## -Time series-specific functionality

In [2]:
import pandas as pd
data=[1,2,3,4,5]
srs=pd.Series(data,index=['a','b','c','d','e'])
print(srs)
print(type(srs))
print(srs['a':'c'])

a    1
b    2
c    3
d    4
e    5
dtype: int64
<class 'pandas.core.series.Series'>
a    1
b    2
c    3
dtype: int64

# DataFrame -Two dimensional labeled data structures with columnsof potentially different types

# Features of Dataframe

## Different column types
## Mutable Size
## Labeled axes
## Arithemetic operations on rows and columns

In [3]:
# list
data=[1,2,3,4,5]
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [4]:
# list
data=[[1,2,3,4,5],[1,2,3]]
df=pd.DataFrame(data,index=['a','b'],columns=['a','b','c','d','e'])
df

   a  b  c    d    e
a  1  2  3  4.0  5.0
b  1  2  3  NaN  NaN

In [5]:
# Dictionary
data={'a':[1,2,3,4,5],'b':[2,4,6,8,9]}
df=pd.DataFrame(data,index=['a','b','c','d','e'])
df

   a  b
a  1  2
b  2  4
c  3  6
d  4  8
e  5  9

In [6]:
dict1={'Fruits':['apple','mango','banana'],'count':[10,12,14]}
df=pd.DataFrame(dict1)
df

   Fruits  count
0   apple     10
1   mango     12
2  banana     14

In [7]:
# Dataframe from numpy Nd array
import numpy as np
data=np.array([['a','b'],[6,12]])
df=pd.DataFrame({'A':data[:,0],'B':data[:,1]})
df

   A   B
0  a   b
1  6  12

In [8]:
data=[1,2]
df=pd.DataFrame(data)
df.rename(index={0:'a',1:'b'},inplace=True)#df.rename(index={0:'a',1:'b'}''',columns={0:'A'}''',inplace=True)

df.columns=['a']
collist=[]
for col in df.columns:
    if col=='a':
        col='b'
    collist.append(col)
df.columns=collist
df

   b
a  1
b  2

In [9]:
# Concatenate  (Outer Join)
#pd.concat([df1,df2])

df=pd.DataFrame({'A':[1,2,3],'B':[2,3,4]})
df

   A  B
0  1  2
1  2  3
2  3  4

In [10]:
df1=pd.DataFrame({'A':[3,4,5],'C':[1,9,10]})
df1

   A   C
0  3   1
1  4   9
2  5  10

In [11]:
df_concat=pd.concat([df,df1])
df_concat

C:\Users\Nainkamaljeet Singh\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   A    B     C
0  1  2.0   NaN
1  2  3.0   NaN
2  3  4.0   NaN
0  3  NaN   1.0
1  4  NaN   9.0
2  5  NaN  10.0

In [12]:
pd.concat([df,df1],axis=1,join='inner')

   A  B  A   C
0  1  2  3   1
1  2  3  4   9
2  3  4  5  10

In [13]:
pd.concat([df,df1],axis=0,join='inner')

   A
0  1
1  2
2  3
0  3
1  4
2  5

In [14]:
pd.merge(df,df1,on=['A'],how='inner')

   A  B  C
0  3  4  1

In [15]:
pd.merge(df,df1,how='right')

   A    B   C
0  3  4.0   1
1  4  NaN   9
2  5  NaN  10

In [16]:
pd.merge(df,df1,how='left')

   A  B    C
0  1  2  NaN
1  2  3  NaN
2  3  4  1.0

In [17]:
pd.merge(df,df1,how='outer')

   A    B     C
0  1  2.0   NaN
1  2  3.0   NaN
2  3  4.0   1.0
3  4  NaN   9.0
4  5  NaN  10.0

In [18]:
import pandas as pd
data=pd.read_csv('chennai_house_price_prediction.csv')
data.head()

,PRT_ID,AREA,INT_SQFT,DIST_MAINROAD,N_BEDROOM,N_BATHROOM,N_ROOM,SALE_COND,PARK_FACIL,BUILDTYPE,UTILITY_AVAIL,STREET,MZZONE,QS_ROOMS,QS_BATHROOM,QS_BEDROOM,QS_OVERALL,COMMIS,SALES_PRICE
0,P03210,Karapakkam,1004,131,1.0,1.0,3,AbNormal,Yes,Commercial,AllPub,Paved,A,4.0,3.9,4.9,4.330,144400,7600000
1,P09411,Anna Nagar,1986,26,2.0,1.0,5,AbNormal,No,Commercial,AllPub,Gravel,RH,4.9,4.2,2.5,3.765,304049,21717770
2,P01812,Adyar,909,70,1.0,1.0,3,AbNormal,Yes,Commercial,ELO,Gravel,RL,4.1,3.8,2.2,3.090,92114,13159200
3,P05346,Velachery,1855,14,3.0,2.0,5,Family,No,Others,NoSewr,Paved,I,4.7,3.9,3.6,4.010,77042,9630290
4,P06210,Karapakkam,1226,84,1.0,1.0,3,AbNormal,Yes,Others,AllPub,Gravel,C,3.0,2.5,4.1,3.290,74063,7406250

In [19]:
data.info(null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7109 entries, 0 to 7108
Data columns (total 19 columns):
PRT_ID           7109 non-null object
AREA             7109 non-null object
INT_SQFT         7109 non-null int64
DIST_MAINROAD    7109 non-null int64
N_BEDROOM        7108 non-null float64
N_BATHROOM       7104 non-null float64
N_ROOM           7109 non-null int64
SALE_COND        7109 non-null object
PARK_FACIL       7109 non-null object
BUILDTYPE        7109 non-null object
UTILITY_AVAIL    7109 non-null object
STREET           7109 non-null object
MZZONE           7109 non-null object
QS_ROOMS         7109 non-null float64
QS_BATHROOM      7109 non-null float64
QS_BEDROOM       7109 non-null float64
QS_OVERALL       7061 non-null float64
COMMIS           7109 non-null int64
SALES_PRICE      7109 non-null int64
dtypes: float64(6), int64(5), object(8)
memory usage: 1.0+ MB

In [20]:
data.shape

(7109, 19)

In [21]:
data.mean()

INT_SQFT         1.382073e+03
DIST_MAINROAD    9.960318e+01
N_BEDROOM        1.637029e+00
N_BATHROOM       1.213260e+00
N_ROOM           3.688704e+00
QS_ROOMS         3.517471e+00
QS_BATHROOM      3.507244e+00
QS_BEDROOM       3.485300e+00
QS_OVERALL       3.503254e+00
COMMIS           1.410057e+05
SALES_PRICE      1.089491e+07
dtype: float64

In [22]:
data.median()

INT_SQFT             1373.0
DIST_MAINROAD          99.0
N_BEDROOM               1.0
N_BATHROOM              1.0
N_ROOM                  4.0
QS_ROOMS                3.5
QS_BATHROOM             3.5
QS_BEDROOM              3.5
QS_OVERALL              3.5
COMMIS             127628.0
SALES_PRICE      10335050.0
dtype: float64

In [23]:
data.count()

PRT_ID           7109
AREA             7109
INT_SQFT         7109
DIST_MAINROAD    7109
N_BEDROOM        7108
N_BATHROOM       7104
N_ROOM           7109
SALE_COND        7109
PARK_FACIL       7109
BUILDTYPE        7109
UTILITY_AVAIL    7109
STREET           7109
MZZONE           7109
QS_ROOMS         7109
QS_BATHROOM      7109
QS_BEDROOM       7109
QS_OVERALL       7061
COMMIS           7109
SALES_PRICE      7109
dtype: int64

In [24]:
data.describe()

,INT_SQFT,DIST_MAINROAD,N_BEDROOM,N_BATHROOM,N_ROOM,QS_ROOMS,QS_BATHROOM,QS_BEDROOM,QS_OVERALL,COMMIS,SALES_PRICE
count,7109.000000,7109.000000,7108.000000,7104.000000,7109.000000,7109.000000,7109.000000,7109.000000,7061.000000,7109.000000,7.109000e+03
mean,1382.073006,99.603179,1.637029,1.213260,3.688704,3.517471,3.507244,3.485300,3.503254,141005.726544,1.089491e+07
std,457.410902,57.403110,0.802902,0.409639,1.019099,0.891972,0.897834,0.887266,0.527223,78768.093718,3.768603e+06
min,500.000000,0.000000,1.000000,1.000000,2.000000,2.000000,2.000000,2.000000,2.000000,5055.000000,2.156875e+06
25%,993.000000,50.000000,1.000000,1.000000,3.000000,2.700000,2.700000,2.700000,3.130000,84219.000000,8.272100e+06
50%,1373.000000,99.000000,1.000000,1.000000,4.000000,3.500000,3.500000,3.500000,3.500000,127628.000000,1.033505e+07
75%,1744.000000,148.000000,2.000000,1.000000,4.000000,4.300000,4.300000,4.300000,3.890000,184506.000000,1.299390e+07
max,2500.000000,200.000000,4.000000,2.000000,6.000000,5.000000,5.000000,5.000000,4.970000,495405.000000,2.366734e+07

In [25]:
data.rename(columns={'PRT_ID':'model'})# rename column

,model,AREA,INT_SQFT,DIST_MAINROAD,N_BEDROOM,N_BATHROOM,N_ROOM,SALE_COND,PARK_FACIL,BUILDTYPE,UTILITY_AVAIL,STREET,MZZONE,QS_ROOMS,QS_BATHROOM,QS_BEDROOM,QS_OVERALL,COMMIS,SALES_PRICE
0,P03210,Karapakkam,1004,131,1.0,1.0,3,AbNormal,Yes,Commercial,AllPub,Paved,A,4.0,3.9,4.9,4.330,144400,7600000
1,P09411,Anna Nagar,1986,26,2.0,1.0,5,AbNormal,No,Commercial,AllPub,Gravel,RH,4.9,4.2,2.5,3.765,304049,21717770
2,P01812,Adyar,909,70,1.0,1.0,3,AbNormal,Yes,Commercial,ELO,Gravel,RL,4.1,3.8,2.2,3.090,92114,13159200
3,P05346,Velachery,1855,14,3.0,2.0,5,Family,No,Others,NoSewr,Paved,I,4.7,3.9,3.6,4.010,77042,9630290
4,P06210,Karapakkam,1226,84,1.0,1.0,3,AbNormal,Yes,Others,AllPub,Gravel,C,3.0,2.5,4.1,3.290,74063,7406250
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7104,P03834,Karapakkam,598,51,1.0,1.0,2,AdjLand,No,Others,ELO,No Access,RM,3.0,2.2,2.4,2.520,107060,5353000
7105,P10000,Velachery,1897,52,3.0,2.0,5,Family,Yes,Others,NoSeWa,No Access,RH,3.6,4.5,3.3,3.920,205551,10818480
7106,P09594,Velachery,1614,152,2.0,1.0,4,Normal Sale,No,House,NoSeWa,Gravel,I,4.3,4.2,2.9,3.840,167028,8351410
7107,P06508,Karapakkam,787,40,1.0,1.0,2,Partial,Yes,Commercial,ELO,Paved,RL,4.6,3.8,4.1,4.160,119098,8507000
7108,P09794,Velachery,1896,156,3.0,2.0,5,Partial,Yes,Others,ELO,Paved,I,3.1,3.5,4.3,3.640,79812,9976480

In [26]:
data.isnull().sum()
data['QS_OVERALL'].isnull()

0       False
1       False
2       False
3       False
4       False
        ...
7104    False
7105    False
7106    False
7107    False
7108    False
Name: QS_OVERALL, Length: 7109, dtype: bool

In [27]:
data.QS_OVERALL=data.QS_OVERALL.fillna(data.QS_OVERALL.mean())

In [28]:
data['QS_OVERALL'].isnull().sum()

0

In [29]:
# drop column
#data.drop(columns=[sl.no])

In [1]:
# correlation 
'''data['PRT_ID', 'AREA', 'INT_SQFT', 'DIST_MAINROAD', 'N_BEDROOM',
       'N_BATHROOM', 'N_ROOM', 'SALE_COND', 'PARK_FACIL', 'BUILDTYPE',
       'UTILITY_AVAIL', 'STREET', 'MZZONE', 'QS_ROOMS', 'QS_BATHROOM',
       'QS_BEDROOM', 'QS_OVERALL', 'COMMIS', 'SALES_PRICE'].corr()'''

"data['PRT_ID', 'AREA', 'INT_SQFT', 'DIST_MAINROAD', 'N_BEDROOM',\n       'N_BATHROOM', 'N_ROOM', 'SALE_COND', 'PARK_FACIL', 'BUILDTYPE',\n       'UTILITY_AVAIL', 'STREET', 'MZZONE', 'QS_ROOMS', 'QS_BATHROOM',\n       'QS_BEDROOM', 'QS_OVERALL', 'COMMIS', 'SALES_PRICE'].corr()"

In [31]:
data.columns

Index(['PRT_ID', 'AREA', 'INT_SQFT', 'DIST_MAINROAD', 'N_BEDROOM',
       'N_BATHROOM', 'N_ROOM', 'SALE_COND', 'PARK_FACIL', 'BUILDTYPE',
       'UTILITY_AVAIL', 'STREET', 'MZZONE', 'QS_ROOMS', 'QS_BATHROOM',
       'QS_BEDROOM', 'QS_OVERALL', 'COMMIS', 'SALES_PRICE'],
      dtype='object')

In [32]:
# indexing by position
data.iloc[1:3,4]

1    2.0
2    1.0
Name: N_BEDROOM, dtype: float64

In [33]:
#indexing by label

#see all the record of mpg column
data.loc[0:3,['QS_OVERALL','COMMIS']]

   QS_OVERALL  COMMIS
0       4.330  144400
1       3.765  304049
2       3.090   92114
3       4.010   77042

In [34]:
data[data['QS_OVERALL']<= 40000].loc[:,'QS_OVERALL']

0       4.330
1       3.765
2       3.090
3       4.010
4       3.290
        ...
7104    2.520
7105    3.920
7106    3.840
7107    4.160
7108    3.640
Name: QS_OVERALL, Length: 7109, dtype: float64

In [35]:
# double up record  using function

f=lambda x:x*2
data['QS_BATHROOM']=data['QS_BATHROOM'].apply(f)

In [36]:
# Srting column in ascending order

data=data.sort_values(by='QS_OVERALL')
data['QS_OVERALL']

4091    2.00
1936    2.06
5786    2.06
1459    2.09
31      2.11
        ...
827     4.90
5154    4.93
7088    4.94
2217    4.95
3291    4.97
Name: QS_OVERALL, Length: 7109, dtype: float64

In [37]:
# Srting column in descending order

data=data.sort_values(by='QS_OVERALL',ascending=False)
data['QS_OVERALL']

3291    4.97
2217    4.95
7088    4.94
5154    4.93
827     4.90
        ...
31      2.11
1459    2.09
5786    2.06
1936    2.06
4091    2.00
Name: QS_OVERALL, Length: 7109, dtype: float64

In [38]:
data.to_csv('To_save.csv')

In [39]:
data.to_json('To_save.json')

In [40]:
data.iloc[0]

PRT_ID              P01083
AREA               T Nagar
INT_SQFT              1649
DIST_MAINROAD           66
N_BEDROOM                1
N_BATHROOM               1
N_ROOM                   4
SALE_COND           Family
PARK_FACIL             Yes
BUILDTYPE           Others
UTILITY_AVAIL       NoSeWa
STREET           No Access
MZZONE                  RH
QS_ROOMS               4.9
QS_BATHROOM             10
QS_BEDROOM               5
QS_OVERALL            4.97
COMMIS              174115
SALES_PRICE       12436750
Name: 3291, dtype: object

In [41]:
data['nk']='nk'

In [43]:
data['nk']

3291    nk
2217    nk
7088    nk
5154    nk
827     nk
        ..
31      nk
1459    nk
5786    nk
1936    nk
4091    nk
Name: nk, Length: 7109, dtype: object